Repository: madmurphy/libgnunet-worker
Catalog: po/*.po
Languages: it

source: Unable to read the notification
it: Impossibile leggere la notifica

source: The scheduler has returned unexpectedly
it: Lo scheduler è ritornato inaspettatamente

source: Error allocating memory for the worker
it: Errore nell'allocare memoria per il worker

source: Unable to open a file descriptor for communicating with the worker
it: Impossibile aprire un file descriptor per comunicare con il worker

source: Double free detected
it: Tentativo di doppio free rilevato

source: `pthread_join()` has returned `%d`, possibly due to a bug in the GNUnet Worker module
it: `pthread_join()` ha restituito `%d`, possibilmente a causa di un bug nel modulo GNUnet Worker

source: `pthread_join()` has returned `%d` (unknown code)
it: `pthread_join()` ha restituito `%d` (codice sconosciuto)

source: `pthread_cond_wait()` has returned `%d`, possibly due to a bug in the GNUnet Worker module
it: `pthread_cond_wait()` ha restituito `%d`, possibilmente a causa di un bug nel modulo GNUnet Worker

source: `pthread_cond_wait()` has returned `%d` (unknown code)
it: `pthread_cond_wait()` ha restituito `%d` (codice sconosciuto)

source: `pthread_timedjoin_np()` has returned `%d`, possibly due to a bug in the GNUnet Worker module
it: `pthread_timedjoin_np()` ha restituito `%d`, possibilmente a causa di un bug nel modulo GNUnet Worker

source: `pthread_cond_timedwait()` has returned `%d`, possibly due to a bug in the GNUnet Worker module
it: `pthread_cond_timedwait()` ha restituito `%d`, possibilmente a causa di un bug nel modulo GNUnet Worker

source: `pthread_cond_timedwait()` has returned `%d` (unknown code)
it: `pthread_cond_timedwait()` ha restituito `%d` (codice sconosciuto)

source: Unable to start a new thread
it: Impossibile avviare un nuovo thread

source: `GNUNET_WORKER_start_serving()` has been invoked from a thread that is already serving as a worker
it: `GNUNET_WORKER_start_serving()` è stato invocato da un thread che sta già servendo come worker

source: The current scheduler is already serving as a worker; the worker's data will not be changed
it: Lo scheduler corrente sta già servendo come worker; i dati associati al worker non verranno modificati
